app/Controllers/Dashboard.php

SELECT *
FROM `documents`
WHERE `uploaded_by` = '1'
OR `shared_with` = '1'
---
    public function index()
    {
        $session = session();
        if (!$session->get('isLoggedIn')) {
            return redirect()->to('/login');
        }

        $documentModel = new DocumentModel();
        $userModel = new UserModel();
        $notificationModel = new NotificationModel();
        $approvalModel = new \App\Models\ApprovalModel();

        $userId = $session->get('id');
        $role = $session->get('role');
        $department = $session->get('department');
        $userName = $session->get('name');

        // Fetch documents based on role and approval status
        if ($role === 'Super User') {
            // Super Admin should see all documents, including those pending approval
            $documents = $documentModel->findAll();
        } elseif ($role === 'Management') {
             $documents = $documentModel->whereIn('department', ['HR', 'Admin', 'Faculty'])->findAll();
        } elseif ($role === 'HR') {
             $documents = $documentModel->whereIn('department', ['Admin', 'Faculty'])->findAll();
        } else {
            $documents = $documentModel->where('uploaded_by', $userId)->orWhere('shared_with', $userId)->findAll();

SELECT *
FROM `notifications`
WHERE `user_id` = '1'
ORDER BY `created_at` DESC
---
        }

        // Fetch notifications
        $notifications = $notificationModel->where('user_id', $userId)->orderBy('created_at', 'DESC')->findAll();

SELECT COUNT(*) AS `numrows` FROM `documents`
SELECT COUNT(*) AS `numrows`
FROM `documents`
WHERE `status` = 'Approved'
SELECT COUNT(*) AS `numrows`
FROM `documents`
WHERE `status` = 'Pending'
SELECT COUNT(*) AS `numrows` FROM `users`
---
        $users = $role === 'Super User' ? $userModel->findAll() : [];

        // Calculate counts for stats (adjust based on what stats you want to show to Super Admin)
        $documentCount = $documentModel->countAll();
        $approvedCount = $documentModel->where('status', 'Approved')->countAllResults();
        $pendingCount = $documentModel->where('status', 'Pending')->countAllResults();
        $userCount = $userModel->countAll();