app/Controllers/Login.php

SELECT *
FROM `users`
WHERE `email` = 'super@univ.edu'
 LIMIT 1
---
    public function process()
    {
        // Validate the form data
        $validation = \Config\Services::validation();
        $validation->setRules([
            'email' => 'required|valid_email',
            'password' => 'required|min_length[6]'
        ]);

        if (!$validation->withRequest($this->request)->run()) {
            // Validation failed, show errors
            return redirect()->back()->withInput()->with('errors', $validation->getErrors());
        }

        // Check if the user exists
        $userModel = new UserModel();
        $user = $userModel->where('email', $this->request->getPost('email'))->first();