app/Controllers/Upload.php

SELECT *
FROM `users`
---
    public function index()
{
    // Check if the user is logged in
    $session = session();
    if (!$session->get('isLoggedIn')) {
        return redirect()->to('/login ')->with('error', 'Please login to upload documents.');
    }

    // Fetch users for sharing
    $userModel = new \App\Models\UserModel(); // Assuming you have a UserModel
    $data['users'] = $userModel->findAll(); // Fetch all users